
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Объект.ОбщийВес = Объект.ЗаявкиНаПеревозку.Итог("Вес");
	Объект.ОбщийОбъем = Объект.ЗаявкиНаПеревозку.Итог("Объем");
	
КонецПроцедуры

&НаСервере
Функция ОбработатьДанныеСтрокиНаСервере(ДанныеСтроки)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Заявка", ДанныеСтроки.Заявка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаПеревозку.ВидГруза КАК ВидГруза,
	|	ЗаявкаНаПеревозку.Объем КАК Объем,
	|	ЗаявкаНаПеревозку.Вес КАК Вес,
	|	ЗаявкаНаПеревозку.ПунктПогрузки КАК ПунктПогрузки,
	|	ЗаявкаНаПеревозку.ПунктРазгрузки КАК ПунктРазгрузки,
	|	ЗаявкаНаПеревозку.Статус КАК Статус
	|ИЗ
	|	Документ.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку
	|ГДЕ
	|	ЗаявкаНаПеревозку.Ссылка = &Заявка";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, Выборка);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЗаявкиНаПеревозкуЗаявкаПриИзменении(Элемент)
	
	СтрокаДок = ЭтаФорма.Элементы.ЗаявкиНаПеревозку.ТекущиеДанные;
	ДанныеСтроки = Новый Структура("Заявка,ПунктПогрузки,ПунктРазгрузки,ВидГруза,Объем,Вес,Статус");
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, СтрокаДок);
	ОбработатьДанныеСтрокиНаСервере(ДанныеСтроки);
	ЗаполнитьЗначенияСвойств(СтрокаДок, ДанныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьСтатусыЗаявок();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусыЗаявок()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивЗаявок", Объект.ЗаявкиНаПеревозку.Выгрузить(, "Заявка").ВыгрузитьКолонку("Заявка"));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаНаПеревозку.Ссылка КАК Заявка,
	|	ЗаявкаНаПеревозку.Статус КАК Статус
	|ИЗ
	|	Документ.ЗаявкаНаПеревозку КАК ЗаявкаНаПеревозку
	|ГДЕ
	|	ЗаявкаНаПеревозку.Ссылка В(&МассивЗаявок)";
	Выборка = Запрос.Выполнить().Выбрать();
	Для Каждого СтрокаТаблицы Из Объект.ЗаявкиНаПеревозку Цикл
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Новый Структура("Заявка", СтрокаТаблицы.Заявка)) Тогда
			СтрокаТаблицы.Статус = Выборка.Статус;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьСтатусыЗаявок();
КонецПроцедуры
