
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().Имя;
	ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя, Истина);
	Если Не ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ТекущийПользовательОбъект = Справочники.Пользователи.СоздатьЭлемент();
		ТекущийПользовательОбъект.Наименование = ИмяПользователя;
		ТекущийПользовательОбъект.Записать();
		ТекущийПользователь = ТекущийПользовательОбъект.Ссылка;
	КонецЕсли;
	ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
КонецПроцедуры
