
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТипЗнч(Параметры.ПараметрыВыбора) = Тип("Структура")
			И Параметры.ПараметрыВыбора.Свойство("Заказчик")
			И ЗначениеЗаполнено(Параметры.ПараметрыВыбора.Заказчик) Тогда
			Объект.Заказчик = Параметры.ПараметрыВыбора.Заказчик
		ИначеЕсли ЗначениеЗаполнено(ПараметрыСеанса.ТекущийПользователь.Заказчик) Тогда
			Объект.Заказчик = ПараметрыСеанса.ТекущийПользователь.Заказчик;
		КонецЕсли;
	КонецЕсли;
	ЭтоПолноправныйПользователь = РольДоступна("ПолныеПрава");
	Элементы.Заказчик.ТолькоПросмотр = Не ЭтоПолноправныйПользователь;
	Элементы.ГруппаШтрихкодСтаутс.Видимость = ЭтоПолноправныйПользователь;
	ОбновитьШтрихкод();
КонецПроцедуры

&НаСервере
Процедура ОбновитьШтрихкод()
	Штрихкод = РегистрыСведений.ШтрихкодыДокументов.ШтрихкодДокумента(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьШтрихкод();
КонецПроцедуры
