
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Перевозчик = ПараметрыСеанса.ТекущийПользователь.Перевозчик;
	ПеревозчикВыбран = ЗначениеЗаполнено(Объект.Перевозчик);
	Элементы.ИнформационнаяНадпись.Видимость = Не ПеревозчикВыбран;
	Элементы.Перевозчик.Видимость = ПеревозчикВыбран;
	Элементы.Страницы.Видимость = ПеревозчикВыбран;
	Если ПеревозчикВыбран Тогда
		УстановитьОтборы();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборы()
	
	ЭлементОтбора = МаршрутныеЗадания.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Перевозчик");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Перевозчик;
	
	ЭлементОтбора = ПаркТранспортныхСредств.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Объект.Перевозчик;
	
КонецПроцедуры
