
Функция Exchange(Parameter)
	
	СтруктураПараметров = Parameter.Получить();
	Параметр = СтруктураПараметров.StringParam;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	ТекстСообщения = ЗаписьXML.Закрыть();
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ТекстОшибки", "");
	СтруктураОтвета.Вставить("ТекстСообщения", Параметр + " with answer");
	
	Результат = СтруктураОтвета;
	Возврат Новый ХранилищеЗначения(Результат, новый СжатиеДанных(9));

КонецФункции
